/*
<div dir="rtl">

# תרגיל 1: מציאת מפלגה לפי אותיות
בתרגיל זה אתם תצרו 2 קבצים בתוך תיקיה. קובץ אחד בשם `index.html` וקובץ נוסף בשם `script.js`.
בקובץ `index.html` יש לכתוב קוד html כלשהו, ובקובץ `script.js` יש לכתוב קוד javascript.

בתרגיל זה יש לכתוב קוד javascript שמקבל אותיות של מפלגה מתוך דף html ומחזיר את שם המפלגה.


## קוד html
בקובץ index.html יש לכתוב קוד html כלשהו. יש להוסיף שדה קלט (input) וכפתור (button) לדף.
עליכם לתת לאלמנטים הללו id ייחודיים כדי שתוכלו להשתמש בהם בקוד javascript.
 יש להוסיף שדה נוסף שיכיל את שם המפלגה שהפונקציה מחזירה.

## קוד javascript
### חלק 1: כתיבת פונקציה
יש לכתוב פונקציה שמקבלת מחרוזת (`string`) שבה יש אותיות ומחזירה את שם המפלגה שהאותיות שייכות לה.

לדוגמא, אם נכניס את האותיות "מרצ" יש להחזיר את המחרוזת "מרץ".
לדוגמה:
* אם האות הראשונה היא מ, יש להחזיר "מחל"
* אם האות הראשונה היא ט, יש להחזיר "ציונות דתית"
* אם האות הראשונה היא כ, יש להחזיר "כחול לבן"

### חלק 2: האזנה לאירוע לחיצת כפתור
צריך ליצור מאזין לכפתור שיצרנו בדף ה-html. כאשר המשתמש ילחץ על הכפתור תופעל הפונקציה שכתבנו.

### חלק 3: הצגת התוצאה
לאחר הפעלת הפונקציה עליכם להציג את התוצאה בדף ה-html.
</div>
*/

function party() {
    const letters = document.getElementById("letters").value;
    let party;
    switch (letters) {
        case "מרצ":
            party = "מרץ";
            break;
        case "טב":
            party = "ציונות דתית";
            break
        case "כך":
            party = "כחול לבן";
            break;
    }
    document.getElementById("result").innerHTML = party;
}

document.getElementById("btn").addEventListener("click", party);
